IDEA StatiCa Open Model
Element1D.Segment Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Line segment with start point and end point
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement Segment { get; set; }
Public Property Segment As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ Segment {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace